app/Controllers/Home.php


        // Actualizar datos en la base de datos
        try {
            $db->table('usuarios')->where('id', $id)->update($userData);
---
UPDATE "usuarios" SET "usuario" = 'user', "nombre" = 'Adriana', "apellido" = 'Perez', "correo_electronico" = 'aperez@example.com', "telefono" = '0983790239'
WHERE "id" = '1'